cylinderExtrude/system/blockMeshDict.txt
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (10 0 0)  //0
    (20 0 0)  //1
    (14.1421 14.1421 0) //2
    (7.0711 7.0711 0) //3
    (0 20 0) //4
    (0 10 0) //5
    (10 0 0.5)  //0
    (20 0 0.5)  //1
    (14.1421 14.1421 0.5) //2
    (7.0711 7.0711 0.5) //3
    (0 20 0.5) //4
    (0 10 0.5) //5        11   // right-up inner hole   

    (-14.1421 14.1421 0) //2  12
    (-7.0711 7.0711 0) //3  13
    (-20 0 0)  //1  14
    (-10 0 0)  //0  15
    (-14.1421 14.1421 0.5) //2'      16
    (-7.0711 7.0711 0.5) //3'        17
    (-20 0 0.5)  //1'     18
    (-10 0 0.5)  //0'       19   //left-up inner hole ref.figure

    (-14.1421 -14.1421 0) //2  20
    (-7.0711 -7.0711 0) //3  21
    (0 -20 0)  //5  22
    (0 -10 0)  //4  23
    (-14.1421 -14.1421 0.5) //2'      24
    (-7.0711 -7.0711 0.5) //3'        25
    (0 -20 0.5)  //5'     26
    (0 -10 0.5)  //4'       27   //left-down inner hole 

    (14.1421 -14.1421 0) //2  28
    (7.0711 -7.0711 0) //3  29
    (14.1421 -14.1421 0.5) //2'      30
    (7.0711 -7.0711 0.5) //3'        31   //right-down inner hole
    
    (0 50 0) //4                                 //32
    (-35.3553 35.3553 0) //2  12              //33
    (-50 0 0)  //1  14                           //34
    (-35.3553 -35.3553 0) //2  20             //35
    (0 -50 0)  //5  22                           //36
    (0 50 0.5) //4'      10                      //37
    (-35.3553 35.3553 0.5) //2'      16       //38
    (-50 0 0.5)  //1'     18                     //39
    (-35.3553 -35.3553 0.5) //2'      24      //40
    (0 -50 0.5)  //5'     26                     //41     outer hole

    (50 -50 0)     //42
    (50 0 0)    //43
    (50 50 0)   //44
    (50 -50 0.5)     //42   45
    (50 0 0.5)    //43     46
    (50 50 0.5)   //44        47   middle-section    

    (200 -50 0)  //48
    (200 0 0)  //49
    (200 50 0)  //50
    (200 -50 0.5)  //51
    (200 0 0.5)  //52
    (200 50 0.5)  //53        outlet */
    
);

blocks
(
    hex (5 3 2 4 11 9 8 10) (10 20 1) simpleGrading (1 1 1)
    hex (3 0 1 2 9 6 7 8) (10 20 1) simpleGrading (1 1 1)  //right-up inner hole 

    hex (13 5 4 12 17 11 10 16) (10 20 1) simpleGrding (1 1 1)  
    hex (15 13 12 14 19 17 16 18) (10 20 1) simpleGrading (1 1 1)//left-up inner hole

    hex (21 15 14 20 25 19 18 24) (10 20 1) simpleGrding (1 1 1)  
    hex (23 21 20 22 27 25 24 26) (10 20 1) simpleGrading (1 1 1)//left-down inner hole

    hex (29 23 22 28 31 27 26 30) (10 20 1) simpleGrding (1 1 1)  
    hex (0 29 28 1 6 31 30 7) (10 20 1) simpleGrading (1 1 1)//right-down inner hole

    hex (12 4 32 33 16 10 37 38) (10 100 1) simpleGrding (1 1 1)  
    hex (14 12 33 34 18 16 38 39) (10 100 1) simpleGrading (1 1 1)
    hex (20 14 34 35 24 18 39 40) (10 100 1) simpleGrding (1 1 1)  
    hex (22 20 35 36 26 24 40 41) (10 100 1) simpleGrading (1 1 1) //OUTER hole

    hex (28 22 36 42 30 26 41 45) (10 100 1) simpleGrding (1 1 1)
    hex (1 28 42 43 7 30 45 46) (10 100 1) simpleGrding (1 1 1)
    hex (2 1 43 44 8 7 46 47) (10 100 1) simpleGrding (1 1 1)
    hex (4 2 44 32 10 8 47 37) (10 100 1) simpleGrding (1 1 1)   //middle-section   

    hex (44 43 49 50 47 46 52 53) (10 100 1) simpleGrding (1 1 1)
    hex (43 42 48 49 46 45 51 52) (10 100 1) simpleGrding (1 1 1)  //outlet */
);

edges
(
    arc 0 3 (9.2388 3.8268 0)
    arc 3 5 (3.8268 9.2388 0)
    arc 1 2 (18.4775 7.6537 0)
    arc 2 4 (7.6537 18.4775 0)
    arc 6 9 (9.2388 3.8268 0.5)
    arc 9 11 (3.8268 9.2388 0.5)
    arc 7 8 (18.4775 7.6537 0.5)
    arc 8 10 (7.6537 18.4775 0.5) //right-up inner hole 

    arc 15 13 (-9.2388 3.8268 0)
    arc 13 5 (-3.8268 9.2388 0)
    arc 14 12 (-18.4775 7.6537 0)
    arc 12 4 (-7.6537 18.4775 0)
    arc 19 17 (-9.2388 3.8268 0.5)
    arc 17 11 (-3.8268 9.2388 0.5)
    arc 18 16 (-18.4775 7.6537 0.5)
    arc 16 10 (-7.6537 18.4775 0.5) //left-up inner hole

    arc 21 15 (-9.2388 -3.8268 0)
    arc 23 21 (-3.8268 -9.2388 0)
    arc 20 14 (-18.4775 -7.6537 0)
    arc 22 20 (-7.6537 -18.4775 0)
    arc 25 19 (-9.2388 -3.8268 0.5)
    arc 27 25 (-3.8268 -9.2388 0.5)
    arc 24 18 (-18.4775 -7.6537 0.5)
    arc 26 24 (-7.6537 -18.4775 0.5) //left-down inner hole

    arc 0 29 (9.2388 -3.8268 0)
    arc 29 23 (3.8268 -9.2388 0)
    arc 1 28 (18.4775 -7.6537 0)
    arc 28 22 (7.6537 -18.4775 0)
    arc 6 31 (9.2388 -3.8268 0.5)
    arc 31 27 (3.8268 -9.2388 0.5)
    arc 7 30 (18.4775 -7.6537 0.5)
    arc 30 26 (7.6537 -18.4775 0.5) //right-down inner hole

    arc 33 34 (-46.194 19.134 0)
    arc 32 33 (-19.134 46.194 0)
    arc 38 39 (-46.194 19.134 0.5)
    arc 37 38 (-19.134 46.194 0.5) 
    arc 34 35 (-46.194 -19.134 0)
    arc 35 36 (-19.134 -46.194 0)
    arc 39 40 (-46.194 -19.134 0.5)
    arc 40 41 (-19.134 -46.194 0.5) //outer hole    */

);

boundary
(
     
    inlet
    {
        type patch;
        faces
        (
            (33 32 37 38)
            (34 33 38 39)
            (35 34 39 40)
            (36 35 40 41)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (49 50 53 52)
            (48 49 52 51)
        );
    } 
    walls
    {
        type wall;
        faces
        (
            (5 3 9 11)
            (3 0 6 9)  //right-up  
        
            (13 5 11 17)
            (15 13 17 19) //left-up
            
            (21 15 19 25)
            (23 21 25 27) //left-down
            
            (29 23 27 31)
            (0 29 31 6)  //right-down 
        );
    } 
    upperWall
    {
        type wall;
        faces
        (
            (32 44 47 37)
            (44 50 53 47)
        );
    }  
    lowerWall
    {
        type wall;
        faces
        (
            (42 36 41 45)
            (48 42 45 51)
        );
    }   
    frontAndBack
    {
        type empty;
        faces
        (
            (5 3 2 4)
            (3 0 1 2)
            (11 9 8 10)
            (9 6 7 8) //right-up  
            
            (12 13 5 4)
            (14 15 13 12)
            (16 17 11 10)
            (18 19 17 16) //left-up
            
            (20 21 15 14)
            (22 23 21 20)
            (24 25 19 18)
            (26 27 25 24) //left-down
            
            (28 29 23 22)
            (1 0 29 28)
            (30 31 27 26)
            (7 6 31 30) //left-up
            
            (12 4 32 33)
            (14 12 33 34)
            (20 14 34 35)
            (22 20 35 36)
            (16 10 37 38)
            (18 16 38 39)
            (24 18 39 40)
            (26 24 40 41) //outer hole
            
            (36 42 28 22)
            (41 45 30 26)
            (28 42 43 1)
            (30 45 46 7)
            (1 43 44 2)
            (7 46 47 8)
            (2 44 32 4)
            (8 47 37 10) //middle-section  

            (42 48 49 43)
            (43 49 50 44)
            (45 51 52 46)
            (46 52 53 47) //outlet */
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
